Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: https://podman.io/[Podman] is an open-source, daemonless, and rootless container engine for developing, managing, and running OCI Containers on Linux, Windows and Mac. It can be used to support the container functionality and Dev Services on Quarkus.
ja_jp: link:https://podman.io/[Podman] は、Linux、Windows、Mac上でOCIコンテナを開発、管理、実行するための、オープンソース、デーモンレス、ルートレスのコンテナエンジンです。 Podmanは、Quarkusのコンテナ機能とDev Servicesのサポートに使用できます。

source: https://polaris.apache.org/[Apache Polaris], an open-source catalog for https://iceberg.apache.org/[Apache Iceberg] has officially graduated to become a Top-Level Project (TLP), capping its incubation with a pivotal technical decision: adopting Quarkus as its cloud-native foundation. The fusion of an Iceberg catalog with Supersonic Subatomic Java delivers not only cloud-native efficiency and extensibility but also community collaboration, positioning Polaris as the leading solution for multi-engine data lakehouse architectures.
ja_jp: https://polaris.apache.org/[Apache Polaris] は、 https://iceberg.apache.org/[Apache Iceberg] 用のオープンソースカタログであり、インキュベーション期間を終え、重要な技術的決定として Quarkus をそのクラウドネイティブ基盤として採用することで、正式に Top-Level Project (TLP) へ昇格しました。Iceberg カタログと Supersonic Subatomic Java の融合は、クラウドネイティブな効率性と拡張性だけでなく、コミュニティとの協業も実現し、Polaris をマルチエンジンデータレイクハウスアーキテクチャ向けの主要なソリューションとして位置付けています。

source: https://pulsar.apache.org/docs/3.0.x/txn-why/[Pulsar transactions] enable event streaming applications to consume, process, and produce messages in one atomic operation.
ja_jp: https://pulsar.apache.org/docs/3.0.x/txn-why/[Pulsar トランザクション] を使用すると、イベントストリーミングアプリケーションが 1 つのアトミック操作でメッセージを消費、処理、生成できます。

source: https://pulsar.apache.org[Apache Pulsar] is an open-source, distributed messaging and streaming platform built for the cloud. It provides a multi-tenant, high-performance solution to server messaging with tiered storage capabilities.
ja_jp: https://pulsar.apache.org[Apache Pulsar] は、クラウド向けに構築されたオープンソースの分散メッセージングおよびストリーミングプラットフォームです。 階層型ストレージ機能により、マルチテナントの高性能ソリューションをサーバーメッセージングに提供します。

source: https://quarkiverse.github.io/quarkiverse-docs/quarkus-quinoa/dev/#getting-started[Here] is the Quinoa guide to go deeper and configure your app with any Node based Web UI framework such as React, Angular, Lit, Webpack, Rollup, ...
ja_jp: link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-quinoa/dev/#getting-started[これ] は、より深く、React、Angular、Lit、Webpack、Rollupなどの任意のNodeベースのWeb UIフレームワークであなたのアプリを構成するためのQuinoaのガイドです...

source: https://quarkus.io/blog/gui-react-patternfly/[Adding Eyecandy to your Quarkus App with React and Patternfly]
ja_jp: link:https://quarkus.io/blog/gui-react-patternfly/[ReactとPatternflyでQuarkusアプリにEyecandyを追加する]

source: https://quarkus.io/blog/quarkus-3-28-released/[Quarkus 3.28 - More security features, custom Grafana dashboards, support for multiple clients in Liquibase MongoDB, and more]
ja_jp: https://quarkus.io/blog/quarkus-3-28-released/[Quarkus 3.28 - セキュリティ機能の強化、カスタムGrafanaダッシュボード、Liquibase MongoDBでの複数クライアントのサポートなど]

source: https://quarkus.io/blog/quarkus-3-29-released/[Quarkus 3.29 - Multiple cache backends and Qute DAP debugger support]
ja_jp: https://quarkus.io/blog/quarkus-3-29-released/[Quarkus 3.29 - 複数のキャッシュバックエンドとQute DAPデバッガーのサポート]

source: https://quarkus.io/blog/quarkus-3-30-released/[Quarkus 3.30 - JsonView on REST Client, Hibernate Validator 9.1, CLI decrypt command, and more]
ja_jp: https://quarkus.io/blog/quarkus-3-30-released/[Quarkus 3.30 - RESTクライアント上のJsonView、Hibernate Validator 9.1、CLI復号コマンドなど]

source: https://quarkus.io/blog/quarkus-3-31-released/[Quarkus 3.31 - Full Java 25 support, Quarkus Maven packaging, Panache Next, and more!]
ja_jp: https://quarkus.io/blog/quarkus-3-31-released/[Quarkus 3.31 - Java 25の完全サポート、Quarkus Mavenパッケージング、Panache Nextなど！]

source: https://quarkus.io/blog/quarkus-3-32-released/[Quarkus 3.32 - Project Leyden integration, more graceful shutdown, automatic Consul registration and more!]
ja_jp: https://quarkus.io/blog/quarkus-3-32-released/[Quarkus 3.32 - Project Leyden統合、より優雅なシャットダウン、自動Consul登録など！]

source: https://quarkus.io/blog/virtual-threads-3/[How to test virtual threads applications]
ja_jp: link:https://quarkus.io/blog/virtual-threads-3/[仮想スレッドアプリケーションのテスト方法]

source: https://quarkus.io/blog/vscode-quarkus-1.10.0[Quarkus Tools for Visual Studio Code 1.10.0 Features Blog]
ja_jp: link:https://quarkus.io/blog/vscode-quarkus-1.10.0[Quarkus Tools for Visual Studio Code 1.10.0 機能ブログ]

source: https://quarkus.io/extensions/com.vaadin/vaadin-quarkus-extension/[Vaadin Flow extension], for this unique framework that lets you build web apps directly from Java code without writing HTML or JavaScript.
ja_jp: https://quarkus.io/extensions/com.vaadin/vaadin-quarkus-extension/[Vaadin Flow エクステンション] は、HTML や JavaScript を記述せずに Java コードから直接 Web アプリケーションを構築できるユニークなフレームワークです。

source: https://quarkus.io/guides/capabilities[Capabilities] this extension provides
ja_jp: https://quarkus.io/guides/capabilities[Capabilities] このエクステンションは以下を提供します。

source: https://quarkus.io/guides/conditional-extension-dependencies[Dependency condition] that has to be satisfied for a conditional dependency on this extension to be activated
ja_jp: このエクステンションへの条件付き依存関係を有効にするために満たす必要がある https://quarkus.io/guides/conditional-extension-dependencies[依存関係の条件]

source: https://quarkus.io/guides/extension-codestart[Codestart] information
ja_jp: https://quarkus.io/guides/extension-codestart[Codestart] 情報

source: https://quarkus.io/guides/logging[`jboss-logging`] (logging API in Quarkus)
ja_jp: https://quarkus.io/guides/logging[`jboss-logging`] (Quarkusのlogging API)

source: https://quarkus.io/guides/qute[Qute Templating Engine page]
ja_jp: link:https://quarkus.io/guides/qute[Qute Templating Engineのページ]

source: https://quarkus.io/guides/vertx[`quarkus-vertx`] (http requests)
ja_jp: link:https://quarkus.io/guides/vertx[quarkus-vertx] (httpリクエスト)

source: https://quarkus.io/guides[Guides^] that were simple enough to get started but applicable to real-world tasks
ja_jp: 簡単に始められて、実際の作業に応用できる https://quarkus.io/guides[ガイド^]

source: https://quay.io/repository/quarkus/blue-service[Blue service container image]
ja_jp: https://quay.io/repository/quarkus/blue-service[Blue サービスのコンテナーイメージ]

source: https://quay.io/repository/quarkus/red-service[Red service container image]
ja_jp: https://quay.io/repository/quarkus/red-service[Red サービスのコンテナーイメージ]

source: https://scoop.sh[Scoop] is a package manager for Windows. You can use Scoop to install (and update) the Quarkus CLI.
ja_jp: https://scoop.sh[Scoop] は、Windows 向けのパッケージマネージャーです。Scoop を使用して、Quarkus CLI をインストール (および更新) できます。

source: https://sdkman.io/[SDKMAN!] can be used to manage development environments. It can manage parallel versions of multiple Software Development Kits on most Unix based systems, making it a very good alternative to keep multiple JDK versions handy.
ja_jp: https://sdkman.io/[SDKMAN!] を使用して、開発環境を管理できます。ほとんどの Unix ベースのシステムで複数のソフトウェア開発キットの並列バージョンを管理できるため、複数の JDK バージョンを便利に使う場合に非常に良い代替手段となります。

source: https://smallrye.io/smallrye-graphql/latest/[Upstream SmallRye GraphQL Client documentation]
ja_jp: link:https://smallrye.io/smallrye-graphql/latest/[Upstream SmallRye GraphQL Client ドキュメント]

source: https://smallrye.io/smallrye-mutiny[Mutiny] is an intuitive, reactive programming library. It is the primary model to write reactive applications with Quarkus.
ja_jp: link:https://smallrye.io/smallrye-mutiny[Mutiny]は、直感的なリアクティブプログラミングライブラリです。Mutinyは、Quarkusでリアクティブアプリケーションを書くための主要なモデルです。

source: https://smallrye.io/smallrye-reactive-messaging/latest/concepts/decorators/[Channel decorators] is a way to intercept and decorate the reactive streams corresponding to messaging channels. This can be useful for adding custom behavior to the channels, such as logging, metrics, or error handling.
ja_jp: https://smallrye.io/smallrye-reactive-messaging/latest/concepts/decorators/[チャネルデコレーター] は、メッセージングチャネルに対応するリアクティブストリームをインターセプトおよびデコレートする方法です。これは、ロギング、メトリクス、エラー処理など、チャネルにカスタム動作を追加するのに役立ちます。

source: https://smallrye.io/smallrye-stork/latest/load-balancer/custom-load-balancer/[Implement a custom service selection provider]
ja_jp: link:https://smallrye.io/smallrye-stork/latest/load-balancer/custom-load-balancer/[カスタムサービスセレクションプロバイダーの実装]

source: https://smallrye.io/smallrye-stork/latest/service-discovery/custom-service-discovery/[Implement a custom service discover provider]
ja_jp: link:https://smallrye.io/smallrye-stork/latest/service-discovery/custom-service-discovery/[カスタム・サービス・ディスカバリー・プロバイダーの実装]

source: https://stackoverflow.com/questions/61767702/what-exactly-is-io-uring[What exactly is io_uring?]: io_uring is a Linux kernel interface to efficiently allow you to send and receive data asynchronously. It was originally designed to target block devices and files but has since gained the ability to work with things like network sockets.
ja_jp: https://stackoverflow.com/questions/61767702/what-exactly-is-io-uring[What exactly is io_uring?]: io_uring は、データを非同期に効率的に送受信できるようにする Linux カーネルインターフェイスです。 もともとはブロックデバイスとファイルを対象に設計されていましたが、その後、ネットワークソケットなどでも動作するようになりました。

source: https://tools.ietf.org/html/rfc7232[HTTP allows requests to be conditional], based on a number of conditions, such as:
ja_jp: 以下のようないくつかの条件の下で、link:https://tools.ietf.org/html/rfc7232[HTTPでは条件付きのリクエストが可能です] :

source: https://upx.github.io/[Ultimate Packer for eXecutables (UPX)] is a compression tool reducing the size of executables. Quarkus can compress the produced native executable to reduce its size. Such compression is interesting when:
ja_jp: https://upx.github.io/[Ultimate Packer for eXecutables (UPX)]は、実行ファイルのサイズを小さくする圧縮ツールです。Quarkusでは、生成されたネイティブ実行可能ファイルを圧縮して、そのサイズを小さくすることができます。このような圧縮は次のような場合に興味深いものです。

source: https://urhengulas.github.io/blog/podman_heroku.html[Source of solutions and workarounds]
ja_jp: https://urhengulas.github.io/blog/podman_heroku.html[解決策と回避策のソース]

source: https://vaadin.com/docs/latest/components[Vaadin Web Components]: Dev UI makes extensive usage of Vaadin web components as UI Building blocks.
ja_jp: https://vaadin.com/docs/latest/components[Vaadin Web コンポーネント]: Dev UI は、UI ビルディングブロックとして Vaadin Web コンポーネントを広範に使用します。

source: https://vale.sh/docs/integrations/guide/[Vale IDE integrations] require the Vale CLI to be installed.
ja_jp: link:https://vale.sh/docs/integrations/guide/[Vale IDEとの連携] には、Vale CLIがインストールされていることが必要です。

source: https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`] or https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`]
ja_jp: https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`] または https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`]

source: https://vertx.io/docs/vertx-core/java/#_reactor_and_multi_reactor[Vert.x Reactor and Multi-Reactor documentation]
ja_jp: link:https://vertx.io/docs/vertx-core/java/#_reactor_and_multi_reactor[Vert.x リアクターとマルチリアクターのドキュメント]

source: https://vertx.io[Vert.x] is a toolkit for building reactive applications. As described in the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture], Quarkus uses Vert.x underneath.
ja_jp: link:https://vertx.io[Vert.x]は、リアクティブなアプリケーションを構築するためのツールキットです。 link:quarkus-reactive-architecture.html[Quarkus Reactive Architecture]に記載されているように、QuarkusではVert.xを下地に使用しています。

source: https://vertx.io[Vert.x] is a toolkit to build reactive applications. The Vert.x ecosystem is enormous. From HTTP and data access abilities to messaging clients via microservice and security facilities, the Vert.x ecosystem is remarkably diverse and versatile. To understand that variety, just check the https://vertx.io/docs/[Vert.x documentation]. That makes Vert.x popular in many areas such as web applications, IoT gateways, banking applications and so on.
ja_jp: https://vertx.io[Vert.x] はリアクティブなアプリケーションを構築するためのツールキットです。Vert.x のエコシステムは膨大です。HTTP やデータアクセス機能からマイクロサービスやセキュリティー機能を介したメッセージングクライアントまで、Vert.x のエコシステムは非常に多様で汎用性に富んでいます。その多様性を理解するには、Vert https://vertx.io/docs/[Vert.xのドキュメント]をチェックしてください。そのため、Vert.xはWebアプリケーション、IoTゲートウェイ、銀行アプリケーションなど、多くの分野で人気があります。

source: https://webauthn.guide/[WebAuthn] is an authentication mechanism designed to replace passwords. In short, every time you write a service for registering new users, or logging them in, instead of asking for a password, you use WebAuthn, which will replace the password.
ja_jp: link:https://webauthn.guide/[WebAuthn] は、パスワードを置き換えるために設計された認証メカニズムです。つまり、新しいユーザーを登録したり、ログインしたりするサービスを書くたびに、パスワードを要求する代わりに、WebAuthn を使って、パスワードを置き換えるのです。

source: https://webauthn.guide/[WebAuthn] is an authentication mechanism that replaces passwords. When you write a service for registering new users, or logging them in, instead of asking for a password, you can use WebAuthn, which replaces the password. For more information, see the xref:security-webauthn.adoc[Secure a Quarkus application by using the WebAuthn authentication mechanism] guide.
ja_jp: link:https://webauthn.guide/[WebAuthn] はパスワードに代わる認証メカニズムです。 新規ユーザーの登録やログインを行うサービスを作成する場合、パスワードの入力を求める代わりにWebAuthnを使用することで、パスワードを置き換えることができます。 詳細については、 xref:security-webauthn.adoc[WebAuthn認証メカニズムを使用したQuarkusアプリケーションの保護] ガイドを参照してください。

source: https://webauthn.guide/[WebAuthn] is an authentication mechanism that replaces passwords. When you write a service for registering new users, or logging them in, instead of asking for a password, you can use WebAuthn, which replaces the password. For more information, see xref:security-webauthn.adoc[Secure a Quarkus application by using the WebAuthn authentication mechanism].
ja_jp: https://webauthn.guide/[WebAuthn] は、パスワードに代わる認証メカニズムです。新しいユーザーを登録したり、ログインしたりするサービスを書くときに、パスワードを要求する代わりに、パスワードを置き換えるWebAuthnを使用することができます。詳しくは、 xref:security-webauthn.adoc[WebAuthn認証メカニズムを使用したQuarkusアプリケーションの保護] を参照してください。

source: https://www.amqp.org/[AMQP 1.0] is a standard for passing messages between applications or organizations. It connects systems, feeds business processes with the information they need, and reliably handles communication between systems. AMQP is a robust and mature protocol widely used in event-driven applications.
ja_jp: link:https://www.amqp.org/[AMQP 1.0] は、アプリケーションや組織間でメッセージを渡すための標準仕様です。AMQP はシステムを接続し、ビジネスプロセスに必要な情報を供給し、システム間の通信を確実に処理します。AMQP は、イベント駆動型のアプリケーションで広く使用されている堅牢で成熟したプロトコルです。

source: https://www.apicur.io/blog/2025/03/30/migrate-registry-2-to-3[Official Apicurio Migration Guide]
ja_jp: https://www.apicur.io/blog/2025/03/30/migrate-registry-2-to-3[公式 Apicurio 移行ガイド]

source: https://www.apicur.io/blog/2025/04/03/evolving-serialization[Apicurio SerDes Evolution Blog Post]
ja_jp: https://www.apicur.io/blog/2025/04/03/evolving-serialization[Apicurio SerDes 進化に関するブログ投稿]

source: https://www.apicur.io/registry/docs/apicurio-registry/3.0.x/index.html[Apicurio Registry 3.x Documentation]
ja_jp: https://www.apicur.io/registry/docs/apicurio-registry/3.0.x/index.html[Apicurio Registry 3.x ドキュメント]

source: https://www.apicur.io/registry/docs/apicurio-registry/3.1.x/getting-started/assembly-migrating-registry-v2-v3.html[Apicurio Registry Deployment Migration Guide]
ja_jp: https://www.apicur.io/registry/docs/apicurio-registry/3.1.x/getting-started/assembly-migrating-registry-v2-v3.html[Apicurio Registry デプロイメント移行ガイド]

source: https://www.drools.org[Drools] is a set of projects focusing on intelligent automation and decision management, most notably providing a forward-chaining and backward-chaining inference-based rule engine, DMN decisions engine and other projects. A rule engine is a fundamental building block to create an expert system which, in artificial intelligence, is a computer system that emulates the decision-making ability of a human expert. You can read more information on the https://www.drools.org[Drools website].
ja_jp: https://www.drools.org[Drools] は、インテリジェントな自動化と意思決定管理に焦点を当てた一連のプロジェクトであり、特に前向き連鎖と後向き連鎖の推論ベースのルールエンジン、DMN 意思決定エンジン、およびその他のプロジェクトを提供しています。ルールエンジンは、人工知能において、人間の専門家の意思決定能力をエミュレートするコンピューターシステムであるエキスパートシステムを作成するための基本的な設定要素です。詳細は、 https://www.drools.org[Drools の Web サイト] を参照してください。

source: https://www.geeksforgeeks.org/computer-networks/basic-concept-of-tcp-vegas/[Basic concept of TCP-Vegas]
ja_jp: https://www.geeksforgeeks.org/computer-networks/basic-concept-of-tcp-vegas/[TCP-Vegas の基本概念]

source: https://www.graalvm.org[GraalVM] is a universal virtual machine for running applications written in various different languages, as well as providing the ability to compile JVM bytecode to a native executable (this native executable runs a special virtual machine called SubstrateVM). These native executables start much faster and can use a lot less memory than a traditional JVM, however not every JVM feature is supported, and some are more limited than normal.
ja_jp: https://www.graalvm.org[GraalVM] は、さまざまな異なる言語で記述されたアプリケーションを実行するためのユニバーサル仮想マシンであり、JVMバイトコードをネイティブ実行可能ファイルにコンパイルする機能を提供します(このネイティブ実行可能ファイルは、SubstrateVMと呼ばれる特別な仮想マシンを実行します)。これらのネイティブ実行可能ファイルは、従来のJVMよりもはるかに高速に起動し、使用するメモリーを大幅に削減できますが、すべてのJVM機能がサポートされているわけではなく、一部は通常よりも制限されています。

source: https://www.heroku.com/[A Heroku Account]. Free accounts work.
ja_jp: link:https://www.heroku.com/[Herokuのアカウント]。無料のアカウントが使えます。

source: https://www.heroku.com/[A Heroku Account]. You need at least an Eco account to deploy an application.
ja_jp: https://www.heroku.com/[Heroku アカウント]。アプリケーションをデプロイするには、少なくとも Eco アカウントが必要です。

source: https://www.jetbrains.com/help/idea/quarkus.html[IntelliJ IDEA Ultimate Edition built-in Quarkus support]
ja_jp: link:https://www.jetbrains.com/help/idea/quarkus.html[IntelliJ IDEA Ultimate Edition組込のQuarkusのサポート]

source: https://www.jetbrains.com/help/idea/quarkus.html[IntelliJ Ultimate Edition built-in Quarkus support]
ja_jp: link:https://www.jetbrains.com/help/idea/quarkus.html[IntelliJ Ultimate Edition組込Quarkusのサポート]

source: https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak Authorization Services Documentation]
ja_jp: link:https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak認可サービスのドキュメント]

source: https://www.keycloak.org/docs/latest/securing_apps/#_client_registration[Keycloak Dynamic Client Registration Service]
ja_jp: https://www.keycloak.org/docs/latest/securing_apps/#_client_registration[Keycloak 動的クライアント登録サービス]

source: https://www.keycloak.org/documentation.html[Keycloak documentation]
ja_jp: https://www.keycloak.org/documentation.html[Keycloak ドキュメント]

source: https://www.liquibase.org/[Liquibase] is an open source tool for database schema change management, it allows managing MongoDB databases via it's https://github.com/liquibase/liquibase-mongodb[MongoDB Extension].
ja_jp: link:https://www.liquibase.org/[Liquibase]は、データベースのスキーマ変更管理のためのオープンソースのツールで、 link:https://github.com/liquibase/liquibase-mongodb[MongoDB エクステンション]を通じて、MongoDB データベースを管理できます。

source: https://www.liquibase.org/[Liquibase] is an open source tool for database schema change management.
ja_jp: link:https://www.liquibase.org/[Liquibase] はデータベーススキーマ変更管理のためのオープンソースツールです。

source: https://www.redhat.com/en/technologies/cloud-computing/openshift/openshift-service-registry[Red Hat OpenShift Service Registry] provides fully managed service registry for handling Kafka schemas.
ja_jp: https://www.redhat.com/en/technologies/cloud-computing/openshift/openshift-service-registry[Red Hat OpenShift Service Registry] は、Kafka スキーマを処理するためのフルマネージドサービスレジストリーを提供します。

source: https://www.slf4j.org/[SLF4J]
ja_jp: link:https://www.slf4j.org/[SLF4J]

source: https://www.w3.org/wiki/LinkHeader[Web Links support]
ja_jp: https://www.w3.org/wiki/LinkHeader[Web リンクのサポート]

source: https://www.webcomponents.org/introduction[Web components Getting started]
ja_jp: https://www.webcomponents.org/introduction[Web コンポーネントスタートガイド]

source: https://xphyr.net/post/podman_on_osx/[another article], with good guidance on `--rootful` and mounting volumes
ja_jp: `--rootful` およびマウントボリュームに関する案内が記載された https://xphyr.net/post/podman_on_osx/[その他の記事]

source: https://youtu.be/coeVxLaXy5M[Migrating Spring Boot "Pet-Clinic" (REST version) to Quarkus] (http://konveyor.io[konveyor.io] meetup recording)
ja_jp: link:https://youtu.be/coeVxLaXy5M[Spring Boot「Pet-Clinic」（REST版）のQuarkusへの移行] （link:http://konveyor.io[konveyor.io] のミートアップレコーディング）

source: https://{appName}.azurewebsites.net/api/hello https://{appName}.azurewebsites.net/api/servlet/hello https://{appName}.azurewebsites.net/api/vertx/hello https://{appName}.azurewebsites.net/api/funqyHello
ja_jp: https://{appName}.azurewebsites.net/api/ https://{appName}.azurewebsites.net/api/hello https://{appName}.azurewebsites.net/api/servlet/hello hello https://{appName}.azurewebsites.net/api/ https://{appName}.azurewebsites.net/api/vertx/hello https://{appName}.azurewebsites.net/api/funqyHello

source: i.e.
ja_jp: 例えば

source: icon:building[title=Non-instantiatable Build Item] Build item can't be instantiated directly, but can be extended/inherited from
ja_jp: icon:building[title=インスタンス化出来ないビルドアイテム] ビルドアイテムは直接インスタンス化することはできませんが、拡張、継承することが可能です。

source: icon:lock[title=Fixed at build time] Configuration property fixed at build time - All other configuration properties are overridable at runtime
ja_jp: icon:lock[title=ビルド時に固定] ビルド時に固定される設定プロパティ - それ以外の設定プロパティは実行時に上書き可能

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.create-empty-flat-views]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.create-empty-flat-views[quarkus.blaze-persistence.create-empty-flat-views]` [.description] -- A boolean flag that allows to specify if empty flat views should be created by default if not specified via `EmptyFlatViewCreation`. By default the creation of empty flat views is enabled i.e. the default value is `true`. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.create-empty-flat-views]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.create-empty-flat-views[quarkus.blaze-persistence.create-empty-flat-views]` [.description] — `EmptyFlatViewCreation` で指定されていない場合、空のフラットビューがデフォルトで作成されるべきかどうかを指定できるブールフラグ。デフォルトでは、空のフラットビューの作成が有効化されています (`true`)。このプロパティーに使用できる値は、 `true` または `false` です。 —

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.create-empty-flat-views]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.create-empty-flat-views[quarkus.blaze-persistence.create-empty-flat-views]` [.description] -- A boolean flag that allows to specify if empty flat views should be created by default if not specified via `EmptyFlatViewCreation`. By default, the creation of empty flat views is enabled i.e. the default value is `true`. Valid values for this property are `true` or `false`. --
ja_jp: icon:lock[title=ビルド時に固定] [[quarkus-blaze-persistence_quarkus.blaze-persistence.create-empty-flat-views]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.create-empty-flat-views[quarkus.blaze-persistence.create-empty-flat-views]` [.description] -- `EmptyFlatViewCreation` で指定されていない場合、空のフラットビューがデフォルトで作成されるべきかどうかを指定できるブールフラグ。デフォルトでは、空のフラットビューの作成が有効化されています (`true`)。このプロパティーに使用できる値は、 `true` または `false` です。 --
